### ✅ Terraform Plan - `prod`

<details>
<summary>Show Plan Output</summary>

```hcl
data.aws_availability_zones.available: Reading...
module.tasks_queue.data.aws_iam_policy_document.publisher: Reading...
module.tasks_queue.data.aws_iam_policy_document.publisher: Read complete after 0s [id=2251163871]
module.tasks_queue.data.aws_iam_policy_document.consumer: Reading...
module.tasks_queue.data.aws_iam_policy_document.consumer: Read complete after 0s [id=1090597757]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform planned the following actions, but then encountered a problem:

  # aws_lb_listener.http will be updated in-place
  ~ resource "aws_lb_listener" "http" {
        id                                                                  = "arn:aws:elasticloadbalancing:us-east-1:000000000000:listener/app/email-platform-prod-alb/503ee7067918807a/f7049f29b3793ff9"
      ~ port                                                                = 4566 -> 80
        tags                                                                = {
            "Environment" = "prod"
            "Name"        = "email-platform-prod-listener"
        }
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.sampleapi.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
      + availability_zone_rebalancing      = "DISABLED"
        id                                 = "arn:aws:ecs:us-east-1:000000000000:service/email-platform-prod/email-platform-prod-sampleapi"
        name                               = "email-platform-prod-sampleapi"
        tags                               = {
            "Component"   = "api"
            "Environment" = "prod"
            "ManagedBy"   = "terraform"
            "Name"        = "email-platform-prod-sampleapi"
            "Service"     = "sampleapi"
        }
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sampleapi_2.aws_ecr_repository.this will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "email-platform/prod/sampleapi_2"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Component"   = "api"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "email-platform-prod-sampleapi_2"
          + "Service"     = "sampleapi_2"
        }
      + tags_all             = {
          + "Component"   = "api"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "email-platform-prod-sampleapi_2"
          + "Service"     = "sampleapi_2"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.sampleapi_2.aws_ecs_task_definition.this will be created
  + resource "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "512"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = "arn:aws:iam::000000000000:role/email-platform-prod-ecs-execution-role"
      + family                   = "email-platform-prod-sampleapi_2"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Component"   = "api"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "email-platform-prod-sampleapi_2"
          + "Service"     = "sampleapi_2"
        }
      + tags_all                 = {
          + "Component"   = "api"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "email-platform-prod-sampleapi_2"
          + "Service"     = "sampleapi_2"
        }
      + task_role_arn            = "arn:aws:iam::000000000000:role/email-platform-prod-ecs-task-role"
      + track_latest             = false
    }

  # module.sampleworker.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
      + availability_zone_rebalancing      = "DISABLED"
        id                                 = "arn:aws:ecs:us-east-1:000000000000:service/email-platform-prod/email-platform-prod-sampleworker"
        name                               = "email-platform-prod-sampleworker"
        tags                               = {
            "Component"   = "worker"
            "Environment" = "prod"
            "ManagedBy"   = "terraform"
            "Name"        = "email-platform-prod-sampleworker"
            "Service"     = "sampleworker"
        }
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 2 to add, 3 to change, 0 to destroy.

Error: only alphanumeric characters and hyphens allowed in "name"

  with module.sampleapi_2.aws_lb_target_group.this[0],
  on modules/ecs-fargate-service/main.tf line 143, in resource "aws_lb_target_group" "this":
 143:   name        = substr(local.resource_name, 0, 32) # TG name max 32 chars

::error::Terraform exited with code 1.

```

</details>

*Validated with LocalStack*